# GBXMLExport Options Encoding Property

Source: https://www.revitapidocs.com/2026/2b7705c3-a448-6ff1-c27a-e1d06cbfba48.htm

---

| GBXMLExport Options Encoding Property |
| --- |

**Note: This API is now obsolete.**

The encoding options to go into the processing instruction for the exported gbXML file.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public string Encoding { get; }
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public ReadOnly Property Encoding As String
	Get
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
property String^ Encoding {
	String^ get ();
}
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
member Encoding : string with get
```

#### Property Value

String See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace